#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "80d40f6b2398afa2e3a08bc5538c94d8" -> "b28288e635277e8cce78350c44825848"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6e90484feda1888f31c71642c1e04d75" -> "74c822f44ba05871a422f14829cb854d"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "c1a453262c15c1282ef3810ccaf67c84" -> "3a25db9098ab598f9f98784b70045b6f"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "2d7f1d1dd7ee4a150357773337bb920d" -> "268c2bc8e1fd517648f9a278dad7c286"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "de8bf7ac1853499917e738ce032dc16c" -> "602d743e6e13e49479f02fdf38404dd7"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "0501ccafe58809bcbbd694b3e9dafbdb" -> "3864d762717b39a7bf5cee22fa55ef15"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "62d13e86aa235fb0b4d9bb22d517758b" -> "b862c9b1b4b7c28c93dbfe597bc23dda"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "fa8d5328596c44e77ed0e669913b0122" -> "a906351f42908b1544a22e0c8b8ff56d"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "2f6f35b6e706e1110ef411669af7547a" -> "1c7b747918a5d3be1fd78fa57539c4e9"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "09cae3e624c88f148a53f9bf83d85f49" -> "edc06177aacb8f17770a40192efcc54d"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c800b7c4cb853e43c5ff571c012a8d3d" -> "70e486c89e11d358978ece7e8cacb188"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "328f816783e1dbec4921714e72d4f4d7" -> "2f7b606c1acf2833b075eeb252029127"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a5078d9af7a729e6adf3ff86350cf725" -> "d510aad8eacb4aea4820a7d0dc540ef4"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "cfa7530a1aa6edeb37e7cf836826735d" -> "28a377185041b0449042f8cd88d04ed8"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "5ac73b560537c336d9e5ab8d0c720305" -> "a1b920c5a7a37d90f96c5545709099b5"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c7664b881ef5eb02aedf7e94d54338b5" -> "dc726127d2ff8face2c43d3ef4cc0edb"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "627b50f767548b59d865cfb162cdf664" -> "41826ec764869b06e83af70480ba40de"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f12f668ab03d7f1887f0c32341d03fa5" -> "fc19ef5b87796e2ffc24fa955b11fcb5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "df20c594c5ba3878cb289f2092b97dc6" -> "ac3707e6a2a14ca4a7302d6735ce2328"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "96471538b0e23956571e02d8160b7382" -> "21c8686ca80d050e89139913debed54a"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "b7e48c468b7e5ef36d2a0d60635cbcbe" -> "30931690ae0e9b1e9952f0607f60ecdd"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8908960f88ce40fcdb1ffec207cbb0ad" -> "2e3a6980ed29ba9d1d9271fdb6eea2be"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "94fe860ded3d3997eb8ca3763101a655" -> "70af85445c3eac0a236a22fa8223584c"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "14acccac546748ee53c111f69329164f" -> "bffe57a5989715d63fd40a2ea4a0629e"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6b70f32f3c1f118b6f00883494bde79f" -> "b49e4701e524183bee7fbf5921a944d0"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "97a04186891c2841735416717409e486" -> "65e16d27f87199ecfd7c85204b7feb8d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "0a99aed4951ece5edf351a8736994b53" -> "810540927afc28f9fe5a28372ed45868"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "262275cbf1357627b34f965aaeebeb7b" -> "35464ca5fd5bca84855b9b7c799419aa"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "974e6bf3ca6b64326678ab1b6cbff75f" -> "3201bc74f40801eecfbf570788b7f4fd"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "6b686393d1d59e43afce68795ddec703" -> "d9f03de494e5e9558d5c99b4a7076df0"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "969325bac554ef69f88d232a4896071d" -> "35e8d16ab801e3c64170e09474b7008c"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6c435f4ee958e551ad441ed96462152a" -> "998321b7cb2c317109d8ce8a5cc3c803"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d120accceafbbf432b14c21f454c9e1d" -> "a5a137144757a593cfce20b35d133843"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "db361e87a2bfefe0588871f4acb435d6" -> "168daf836f8d79d1dc4aa62c692f262b"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "969942d72977fa2062d81387362469a7" -> "8e26b2d61e9facee4f1aace7e39cc0d9"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "fed4842405a1fc530b169c7f1d33ba96" -> "8472107f6f8edcf06b7619b8322a0ff3"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "2a5e1e2991f0221dd62e0a10acb40eaf" -> "cc3e9d1cb2a90401a64804e07ce0b379"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8d420a74277c014252865a8753f1eb9" -> "4b01e118906d5f1077d43c0a51e4027a"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "72021b1d168719628d64c2c06fd9f584"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/modify_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/modify_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "c859bcc45e73cb5ff16cfe041f16c426" -> "7d7edd04ab520ebe1311f26c29832a50"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "f4f4e3ec69473e3ed30bcf619ec11644" -> "dfe358f2bcde18bbb0c962a858e09b6e"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "5573c37f3048302272bb101d10016aac" -> "a1c687f2e3124a2cdccb2125897b0586"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "08e18a3a66a12fd91d00cd9d4a33b937" -> "8b74bacb4ff7a6c295aa5c083fddf024"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "01321b1e9b306a11503b214c19dce63f" -> "0e2e45d1d02a80aa4d8d894cbe7206bb"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8b03e919e09f0ef9691a6420114c1823" -> "c77b9c279e9c387013bcbe5f44a6b71f"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "pz3htoD0yNlo6x0SHrigBiBUo7gdUoxPY/Ku3K2Atbc=" -> "sMDQoI1sBxACuMlgOYJM+yE/lQcx9w8M+5LXS/pTj3U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFbf4lqphaxxooKg/ZhertyLxix14CspjtI9hI3fDQo=" -> "Gwo7H3NkWdPIBG0Tib/VV52TnQYoci727EVLyMxXW7o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "SbNUI5QYL84E99oTrv26R2DSJnXJpzZu4AtD95fYuGE=" -> "Sf5BqXBG4VaYGohB56NmXDc6spJoUDQYGV8j4zVNYGU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "FOk5rgRrWLFbS195sL1zgZsmlsGomSBZsC583ngQteQ=" -> "i8oBT5GFXbmhz51Krm5JvlZ1QgakR1przEPS0ktS4Lo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "7uWq7APVF/i42CJSxe4ZbAFEySLMX6szl7npcR8zYQg=" -> "xbuF9LSgnfgA4Mpktb72YBXLLQpo5EgefDic1E32200="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "V8DJPePO2ysYdgJlvePikqKyT8bBqM6jEAeUq0Z35DU=" -> "2BEe7mX4PB3EvZGj4+r7bhFfRUVM6WDnQG3J4g9a2Gc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "M0qv/E7aSFeRKn19Q81eAk1yr4/ugKD7hk1z2rFFp88=" -> "g+iUG8jfdVFSHqdJ8sHMbQNpdVJY+FeGSXXDOSo6llA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "gKNcksXN0wa8i/FXKkJ8FEyp9wCI/Tg3UwwsvobYWdM=" -> "1GqrlAtjNF6VbGuo1VFGgEM55O0mA/GdtSGW90o3rmY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "72nnnjaxAOm3s5N6rweO0T8LVl9dYPyC8LRdpRXw+Ug=" -> "n9hMgjNT9UkfCLXcU7oI0G50bNrGRCI3xtQNOUyZryw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cx3ej0kRI4s/vC172/kIgVXKpt52eo69+sgXAE0HRtQ=" -> "l4vdwQ4Eo6Amt6cNIVVID0uCw76hRS5h4fHjKjJWtoA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tq7tJtoO6oWppe0inIpIZ1vXDNtvtJ7BXHLzeOOnGJE=" -> "+vU35KordFo2hTGq/53mdezsaW7GshdqI+OH4mEs9ew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "cjwN3AHZzZYnKc3oKP4EYLk9rgaOc7hmRXbjx07HrZk=" -> "rc06b4+yyxXvPxuhk0XOmfm7kjS1xfKwyxB0QvHiAvk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "gjaICGuKDu4YwCpm/taQjAkT30g32Xa4/ZnZrDrBRrA=" -> "9vNZNVaIr9NNMn+3ep2xm13A6lTtoOwI9xhsWhYC/Kw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "EH9ONU4wEjTC65k4bkYg4xSo8VFBuDHlMC4OwWb2nuM=" -> "Y5wrAOGQw41c1UD0khOwZzlDT97mCxUjwY+o4nEkfLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "83gNft9CciqnCfkFirTLxVKC+jAzZ3/707gwQqGMpio=" -> "cBaplIq+kE1c3q6m7WyDqwYRHYVE7ldW2ahn4p86mho="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "u9wCH7HjzkFrgjZ3HTVqKcBkLqvJGbFJ2LNqbIBzKMs=" -> "hJ713Q45b3ZNMzVpXgM6CUdehfFwBXtZ0fvb5Nc1hA0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "HeA+IRwBQzOATdr3YG1G7RKYRG7J/HD2srDMAYplr8U=" -> "8+zpCeX9AVTQ+lD23pbvC82DUvC7iOahYSTCYu7bljU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ztYVVIXBG0LCnk9bOKqqYWKuRaJLow/Jmz9KSOrYki4=" -> "VoDLPecEtxX4XsJfdrb6ZWOsokaFUtI1u5oCOyooxsk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EkUpleTTnZK4EQQYUz5vBZygzmKp8W2/hqiLhP+tLDc=" -> "i7LggZOsLYC4zwaoDRbnGY+FGjP+BnK/vw0whx7vHYM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "nlXDSgWSqKuoPdCBse9eMaj1t26p6lzXHWQwrRHCcNk=" -> "2pbDbqWL1ztzide91FnSQ3R8AygIhPHxT8iHu5GzoXg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "deIbtMjgQiefvsWkBApK/2afkVKPeK1UiBlJaN6aMcM=" -> "z3IRq74OgCqbiFrHjYlDHYaWFRGTItaQWIc0L0e4ETI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "qjeeELthImR/KTjs/UzYiSBOWPyr652GErsebgN6AaU=" -> "Gq6Zn28HVmY5S8ov+PYVcDEz6pFjCyeCwRGoeNDsalo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "fBzD2YiadsPROd8U28Fxg5thT2qbxOrRo/Ureod2IWI=" -> "kCH8U3wvjntTfmuUZxXUh2lDKY0ydlN3kg8UX0PiJBk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "AHcCUCTQBphwcSzRlmV+ShbE3UK/c+bia1mmmMZLqKU=" -> "0n0DiiFRjCgA150nRnU/7/sZ/O8DjKreoz/5hW5XIMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DX5KKbPwZjRN36Iv2luKiNn8T7G3mslgQUCrVP3Ch9E=" -> "psT5Fy+58HpPNXa9ZHDxSuX1FiK4SrJMXo/Zd1hAq9E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "kfFSidhWh0eF/0CPXIj8YcjSlj1vsDEZiFq6EIyOxm8=" -> "GpL5Nc4lGxIG1En0UvD7W1ZQr9MBtl8Z+c1Xeh2tHEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "La7Z4T5jatluSRSKnJymLur3BNaZnGAM4NcNB9lzjCM=" -> "rg/oObRjPKI72CS6VhQKoFhtqretYr7x5QXnN1NxhSc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "AvnP03wLKF4ZCXvJQcLOih6weaO0tmEAfAkFbKMvXnA=" -> "cf/brtqHQSTZ+ixGA+d92kUw4jcMb3l/ehftLNqd/SA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "/a6m0Fg2e+yD+W2HMvt/KcP8sqnWdxeJ6+C1sfN8nB0=" -> "ynp7/sJ9b+ZxycSEDizJNaN8frQj6/Y0wDVuuUIwv6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPh+qbjepVjFqR/ms/QN5v/y+YIwTML7Kz639PMncI=" -> "nVkmhkctY0c5IeIvDuSKr3kYb6Gzi7J8mlJ9Lxq0vY4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry3D4SuqfJXyFQEBbDJikMTsc+iid968GTDE12Dym7o=" -> "j+A2Lmggixbpkuy3OvIjLYloHxCYFCeJ5MltzAx0tQU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "ayMrDZVaN2uri1daMpHUdNS/cKQMiyjGL8mTKEvXwmo=" -> "R/CEm70oqJ3Hck7/PHKSiHeyz/8IdKzBgLRLvDmKokg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+1qxqARajc3jpyh4hZfu5edrDafIkSmra8zSNaaPg8=" -> "usrNkN4Hx+jJRf2r6eSpZ9JGc0MoJs1G2V/+WE6ERek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "pywKnu6y00eoREjkmVxmN1AUqAxp9FpWq9SfPVlqSUE=" -> "LL5bUwGito8bzbG11sU5Ff2xzCh84n+E7eIuvylc5Ek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "u65H4hUOS+Fs5subesztK0fmevWmicwYirYTAZSGySA=" -> "TwXp2/W1+7AIzwlQbW6U/QU3P/yw7hjltQ73J9J6FlA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdA9ZoqQxAWMRFhnd+cxv594QkuF2QTc9QzDMghe3cs=" -> "j8xzeH65JJVoLjzAwe9mTtK2NnKXDEkZqCbl4kcLQls="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "3lND2H6LF16D8D1jM7DbuH+eAuGgF186ClfBfEvXWLY=" -> "VX1ZT7mhvv+sMTnJoWKqebMjIQ7NOAoX5X0nzYfl4oo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be created
  + resource "aws_lambda_function" "modify_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_modify_ranges_lambda_function"
      + handler                        = "modify_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/modify_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "d3uZSchmrIgFzPGkrUV8xcPupTYtRGyCd2cCL1WRAZU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "glz/flXmItcDZ7p8Oqo/MEAxP88dFD3I59MeC3/fjUY=" -> "zZdPYnrgtnLmXjhQByDvgn6SkM8x7fybWqGhzE9TVR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "9DF5NccVpymq830SRBsYeaLKbPk/k5vHlc97UfMnzuU=" -> "ygqCBK4tL6FrMNZU6ROan6cNWTOxiLlxRDoWu8bD86Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "Wygx505fhv8BSn+Vfuk1r+6bbLB3DVnW5J84+VV1Xzw=" -> "hP82tTkrUesF8fcMypQMHdCDP4J2MSLPyqHgPvsCgNQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "wOO+YHgAF5dRu2QJwZ99289sLJ+lIqCX7DaY3GNSeWc=" -> "Z0VtmKk4+JJQ4pt+W/yBuHuN0+TG1RdkR9OWGRKBJOY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "C5tjjrynkpihF2ulYNusG6ZoAVt37Y5oXZWL0gAzlk8=" -> "YzAWJUAQ5TTzoZecxDygBVQojycHcsLBMaDme+9SG+s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "EGvlWfq0aPsTOzU4plwNBuz4cNwrCFgLTULB7ju3HHU=" -> "iv+yEEIPZoIYuAiqnuciDYmlaeNHbq7W0Xglwu2MyqM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-08T22:46:33Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "v9bqr6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.modify_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "modify_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_modify_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.modify_ranges_integration will be created
  + resource "aws_api_gateway_integration" "modify_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "xqe34y"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.modify_ranges_method will be created
  + resource "aws_api_gateway_method" "modify_ranges_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = "xqe34y"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.modify_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "modify_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_modify_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.modify_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "modify_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_modify_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_modify_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_modify_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_modify_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 11 to add, 89 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*